#include "BST.h"

int main()
{
    demoMenu();

    menuA();
    menuB();
    menuC();
    menuD();

    removeTest();

    mergeTest();

    return 0;
}

/*
Задача 2. Напишете функция за добавяне на елемент в дървото
рекурсивно с двоен указател, подаван като параметър:
 void insert(int x, struct tree **T)
*/

/*DEMO*/

/*              10                    */
/*           /      \                 */
/*          5        12               */
/*        /  \      /  \              */
/*       2    7    11   21            */

/*
Задача 3. Да се построи наредено двоично дърво за
търсене чрез последователно добавяне на следните
върхове:
а) 7, 14, 28, 35, 65, 12, 18, 42, 81, 64, 61, 4, 13
б) 12, 7, 14, 81, 42, 18, 61, 4, 64, 35, 13, 28, 65
в) 4, 7, 12, 13, 14, 18, 28, 35, 42, 61, 64, 65, 81
г) 81, 65, 64, 61, 42, 35, 28, 18, 14, 13, 12, 7, 4
д) 28, 64, 13, 42, 7, 81, 61, 4, 12, 65, 35, 18, 14
Да се сравнят получените дървета. Какви изводи могат
да се направят?
*/

/*
Задача 4. Да се изтрият в този ред върховете 1, 7, 12 и 14 от дървото на
*/

/*
Задача 5. Да се напише рекурсивен вариант на функцията за обхождане на
двоично дърво.
*/

/*
Задача 6. Напишете функция за merge на две бинарни дървета.
*/