#include <stdio.h>
#include "area.h"

int main(){
    double radius;

    printf("Input radius: ");
    scanf("%lf", &radius);

    printf("Circle area is: %lf", circleAarea(radius));

    return 0;
}

/*
Задача 1.Направете глобална константа pi = 3.14, както правихме в
предишния урок. Напишете функция, която изчислява площта на кръг, на
която като параметър подаваме радиуса и връщаме площта на кръга.
Използвайте глобалната константа pi за да извършите изчисленията.
Извикайте функцията в main() и покажете резултата.

*/