#include "vector.h"

int main()
{
    menu1(); //task1

    //task2 = updateCapacity();

    return 0;
}

/*
Задача 1. Да се направи програма, която заделя динамичен масив с брой
елементи зададени от потребителя. За всеки елемент от масива се очаква
потребителят да въведе цяло и число и след това се изчислява сумата на
всички елементи от масива.
Задача 2. Разширяване на заделена памет с realloc.
Задача 3 Напишете функции, с помощта на които да реализирате
динамичен масив от елементи, чиято големина може да се променя по
време на изпълнение на програмата.
Задача 4. Заделете динамично с malloc памет за char* buffer с размер size =
2. Въвеждайте символи от конзолата с getchar() ги четете, записвайте ги в
буфера. Увеличавайте размера на буфера преди да се препълни с realloc().
Прекъснете цикъла с Ctrl + Z. Принтирайте буфера и освободете паметта.
Задача 5. Заделете динамична памет за масив от елементи, като извикате
функция, която нулира заделената памет.
Задача 6. Напишете програма, която пита потребителя колко памет иска и заделя
съответният блок памет. След това попитайте потребителя за нов размер и
използвайте функция, която прави това.
Задача 7. Реализирайте масив с променлива размерност. Началният размер на
масива да бъде въведен от потребителя. Запълнете масива с избрани от вас цели
числа. Изведете масива на екрана. Запитайте потребителя за нов размер на
масива и повторете предните операции - запълнете масива с избрани от вас числа
и го изведете на екрана.
Задача 8. Напишете програма, в която се въвеждат пореден номер, име,
фамилия, възраст на участници в маратон. Изискването е за името и
фамилията да не се използват масиви с фиксирана дължина. След като
въвеждането завърши, изведете списък с участниците.
Задача 9. Използвайки предишното упражнение, изведете участниците
подредени по азбучен ред.
*/