#include <stdio.h>

void printstr(char *str)
{
    int index = 0;
    while (str[index] != '\0')
    {
        printf("%c ", str[index]);
        index++;
    }
}

int main()
{
    char str[100] = "Hello World!";
    printstr(str);

    return 0;
}

/*
Задача 1. Напишете функция, която печата низ, като принтирате всеки
символ поотделно. Указателя към началото му е подаден като аргумент на
функцията void printstr(char *s); Не забравяйте, низът винаги
завършва с знак за терминираща нула '\0', затова проверката в цикъла, който
принтира всеки символ, трябва да е докато не се стигне този знак.
*/
