#include <stdio.h>

void printArray(int array[], int size)
{
    if (size == 0)
    {
        printf("[ ]\n");
        return;
    }
    printf("Array elements: [ ");

    for (int i = 0; i < size; i++)
    {
        if (i != size - 1)
        {
            printf("%d, ", array[i]);
        }
        else
        {
            printf("%d ]\n", array[i]);
        }
    }
}

int main()
{
    int arr[10] = {100, 90, 80, 70, 60, 50, 40, 30, 20, 10};
    int *pointer = arr;

    *(pointer + 2) = 5;
    *(pointer + 3) = 33;
    *(pointer + 4) = 7;
    *(pointer + 6) = 10;
    *(pointer + 9) = 3;

    printArray(arr, 10);

    for (pointer = arr; pointer < arr + 10; pointer++)
    {
        printf("%d ", *pointer);
    }
    return 0;
}

/*
Задача 11.Дефинирайте едномерен масив int с 10 елемента =
{100,90,80,70,60,50,40,30,20,10} Дефинирайте пойнтер, който ще сочи към
масива.
Достъпете 3 тия елемент от масива и му задайте стойност 5.
Достъпете 4 тия елемент и му задайте стойност 33.
Достъпете 5 тия елемент и го намалете със 7.
Достъпете 7 мия елемент и го увеличете с 10.
Достъпете 10 тия елемент и го умножете по 3.
Изпишете го по двата възможни начина и закоментирайте единия.
Принтирайте на екрана всички елементи на масива.
*/