#include <stdio.h>
#include "area.h"

int main(){

    area();

    return 0;
}

/*
Задача 2. Напишете функция area() без параметри. Поискайте от
потребителя да въведе радиуса с помощта на функциите :
printf("Enter a radius\n");
scanf("%lf", &r);
Използвайте горната функция 1.за изчисляване на площта на кръг, която
написахме преди малко за да изчислите площта на кръга с този радиус и
върнете резултата:
*/